# Поправка Беньямини-Хохберга

# Депрессивный эпизод. Дофаминовая система.

#генотипы ДЭ
p_vals <- c (0.071, 0.683, 0.36, 0.355, 0.925)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH
sum(p_BH <= 0.05)

#аллели ДЭ
p_vals <- c (0.022, 0.892, 0.175, 0.292, 0.967)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH

# Рекуррентная депрессия. Дофаминовая система.

#генотипы РД
p_vals <- c (0.0796, 0.553, 0.215, 0.044, 0.667)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH

#аллели РД
p_vals <- c (0.039, 0.672, 0.559, 0.061, 0.367)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH

# Тревожная депрессия. Дофаминовая система.

#генотипы ТД
p_vals <- c (0.005, 0.811, 0.644, 0.302, 0.788)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH

#аллели ТД
p_vals <- c (0.001, 0.522, 0.432, 0.275, 0.668)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH

#Суицид

#Генотипы

p_vals <- c (0.019, 0.064, 0.076, 0.108, 0.241, 0.664, 0.414, 0.343, 0.271, 0.315)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH

#Аллели
p_vals <- c (0.009, 0.028, 0.029, 0.098, 0.115, 0.393, 0.248, 0.184, 0.157)
p_BH <- p.adjust(p_vals, method = 'BH')
p_BH
